Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_dsi.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32U5Gx_dsi.
; ==============

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32U5Gx_dsi equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// DSI address definitions
// -----------------------

#ifndef ADDITIONAL_DSI_S
typedef struct {
    volatile    uint32_t    VR;
    volatile    uint32_t    CR;
    volatile    uint32_t    CCR;
    volatile    uint32_t    LVCIDR;
    volatile    uint32_t    LCOLCR;
    volatile    uint32_t    LPCR;
    volatile    uint32_t    LPMCR;
    volatile    uint32_t    RESERVED0[4];
    volatile    uint32_t    PCR;
    volatile    uint32_t    GVCIDR;
    volatile    uint32_t    MCR;
    volatile    uint32_t    VMCR;
    volatile    uint32_t    VPCR;
    volatile    uint32_t    VCCR;
    volatile    uint32_t    VNPCR;
    volatile    uint32_t    VHSACR;
    volatile    uint32_t    VHBPCR;
    volatile    uint32_t    VLCR;
    volatile    uint32_t    VVSACR;
    volatile    uint32_t    VVBPCR;
    volatile    uint32_t    VVFPCR;
    volatile    uint32_t    VVACR;
    volatile    uint32_t    LCCR;
    volatile    uint32_t    CMCR;
    volatile    uint32_t    GHCR;
    volatile    uint32_t    GPDR;
    volatile    uint32_t    GPSR;
    volatile    uint32_t    TCCR0;
    volatile    uint32_t    TCCR1;
    volatile    uint32_t    TCCR2;
    volatile    uint32_t    TCCR3;
    volatile    uint32_t    TCCR4;
    volatile    uint32_t    TCCR5;
    volatile    uint32_t    RESERVED1;
    volatile    uint32_t    CLCR;
    volatile    uint32_t    CLTCR;
    volatile    uint32_t    DLTCR;
    volatile    uint32_t    PCTLR;
    volatile    uint32_t    PCONFR;
    volatile    uint32_t    PUCR;
    volatile    uint32_t    PTTCR;
    volatile    uint32_t    PSR;
    volatile    uint32_t    RESERVED2[2];
    volatile    uint32_t    ISR0;
    volatile    uint32_t    ISR1;
    volatile    uint32_t    IER0;
    volatile    uint32_t    IER1;
    volatile    uint32_t    RESERVED3[3];
    volatile    uint32_t    FIR0;
    volatile    uint32_t    FIR1;
    volatile    uint32_t    RESERVED4[5];
    volatile    uint32_t    DLTRCR;
    volatile    uint32_t    RESERVED5[2];
    volatile    uint32_t    VSCR;
    volatile    uint32_t    RESERVED6[2];
    volatile    uint32_t    LCVCIDR;
    volatile    uint32_t    LCCCR;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    LPMCCR;
    volatile    uint32_t    RESERVED8[7];
    volatile    uint32_t    VMCCR;
    volatile    uint32_t    VPCCR;
    volatile    uint32_t    VCCCR;
    volatile    uint32_t    VNPCCR;
    volatile    uint32_t    VHSACCR;
    volatile    uint32_t    VHBPCCR;
    volatile    uint32_t    VLCCR;
    volatile    uint32_t    VVSACCR;
    volatile    uint32_t    VVBPCCR;
    volatile    uint32_t    VVFPCCR;
    volatile    uint32_t    VVACCR;
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    FBSR;
    volatile    uint32_t    RESERVED10[165];
    volatile    uint32_t    WCFGR;
    volatile    uint32_t    WCR;
    volatile    uint32_t    WIER;
    volatile    uint32_t    WISR;
    volatile    uint32_t    WIFCR;
    volatile    uint32_t    RESERVED11;
    volatile    uint32_t    WPCR0;
    volatile    uint32_t    RESERVED12[5];
    volatile    uint32_t    WRPCR;
    volatile    uint32_t    RESERVED13[245];
    volatile    uint32_t    BCFGR;
    volatile    uint32_t    RESERVED14[254];
    volatile    uint32_t    DPCBCR;
    volatile    uint32_t    RESERVED15[11];
    volatile    uint32_t    DPCSRCR;
    volatile    uint32_t    RESERVED16[14];
    volatile    uint32_t    DPDL0BCR;
    volatile    uint32_t    RESERVED17[11];
    volatile    uint32_t    DPDL0SRCR;
    volatile    uint32_t    RESERVED18[25];
    volatile    uint32_t    DPDL1BCR;
    volatile    uint32_t    RESERVED19[11];
    volatile    uint32_t    DPDL1SRCR;
} DSI_TypeDef;

#ifdef __cplusplus
#define DSI_NS  reinterpret_cast<DSI_TypeDef *>(0x40016C00U)
#define DSI_S   reinterpret_cast<DSI_TypeDef *>(0x50016C00U)

#else
#define DSI_NS  ((DSI_TypeDef *)0x40016C00U)
#define DSI_S   ((DSI_TypeDef *)0x50016C00U)
#endif
#endif

// VR Configuration

#define DSI_VR_VERSION              (0xFFFFFFFFU<<0)
#define DSI_VR_VERSION_0            (0x1U<<0)

// CR Configuration

#define DSI_CR_EN                   (0x1U<<0)
#define DSI_CR_EN_B_0X0             (0x0U<<0)
#define DSI_CR_EN_B_0X1             (0x1U<<0)

// CCR Configuration

#define DSI_CCR_TOCKDIV             (0xFFU<<8)
#define DSI_CCR_TOCKDIV_0           (0x1U<<8)
#define DSI_CCR_TXECKDIV            (0xFFU<<0)
#define DSI_CCR_TXECKDIV_0          (0x1U<<0)

// LVCIDR Configuration

#define DSI_LVCIDR_VCID             (0x3U<<0)
#define DSI_LVCIDR_VCID_0           (0x1U<<0)

// LCOLCR Configuration

#define DSI_LCOLCR_LPE              (0x1U<<8)
#define DSI_LCOLCR_COLC             (0xFU<<0)
#define DSI_LCOLCR_COLC_0           (0x1U<<0)
#define DSI_LCOLCR_LPE_B_0X0        (0x0U<<8)
#define DSI_LCOLCR_LPE_B_0X1        (0x1U<<8)
#define DSI_LCOLCR_COLC_B_0X0       (0x0U<<0)
#define DSI_LCOLCR_COLC_B_0X1       (0x1U<<0)
#define DSI_LCOLCR_COLC_B_0X2       (0x2U<<0)
#define DSI_LCOLCR_COLC_B_0X3       (0x3U<<0)
#define DSI_LCOLCR_COLC_B_0X4       (0x4U<<0)
#define DSI_LCOLCR_COLC_B_0X5       (0x5U<<0)

// LPCR Configuration

#define DSI_LPCR_HSP                (0x1U<<2)
#define DSI_LPCR_VSP                (0x1U<<1)
#define DSI_LPCR_DEP                (0x1U<<0)
#define DSI_LPCR_HSP_B_0X0          (0x0U<<2)
#define DSI_LPCR_HSP_B_0X1          (0x1U<<2)
#define DSI_LPCR_VSP_B_0X0          (0x0U<<1)
#define DSI_LPCR_VSP_B_0X1          (0x1U<<1)
#define DSI_LPCR_DEP_B_0X0          (0x0U<<0)
#define DSI_LPCR_DEP_B_0X1          (0x1U<<0)

// LPMCR Configuration

#define DSI_LPMCR_LPSIZE            (0xFFU<<16)
#define DSI_LPMCR_LPSIZE_0          (0x1U<<16)
#define DSI_LPMCR_VLPSIZE           (0xFFU<<0)
#define DSI_LPMCR_VLPSIZE_0         (0x1U<<0)

// PCR Configuration

#define DSI_PCR_ETTXLPE             (0x1U<<5)
#define DSI_PCR_CRCRXE              (0x1U<<4)
#define DSI_PCR_ECCRXE              (0x1U<<3)
#define DSI_PCR_BTAE                (0x1U<<2)
#define DSI_PCR_ETRXE               (0x1U<<1)
#define DSI_PCR_ETTXE               (0x1U<<0)
#define DSI_PCR_ETTXLPE_B_0X0       (0x0U<<5)
#define DSI_PCR_ETTXLPE_B_0X1       (0x1U<<5)
#define DSI_PCR_CRCRXE_B_0X0        (0x0U<<4)
#define DSI_PCR_CRCRXE_B_0X1        (0x1U<<4)
#define DSI_PCR_ECCRXE_B_0X0        (0x0U<<3)
#define DSI_PCR_ECCRXE_B_0X1        (0x1U<<3)
#define DSI_PCR_BTAE_B_0X0          (0x0U<<2)
#define DSI_PCR_BTAE_B_0X1          (0x1U<<2)
#define DSI_PCR_ETRXE_B_0X0         (0x0U<<1)
#define DSI_PCR_ETRXE_B_0X1         (0x1U<<1)
#define DSI_PCR_ETTXE_B_0X0         (0x0U<<0)
#define DSI_PCR_ETTXE_B_0X1         (0x1U<<0)

// GVCIDR Configuration

#define DSI_GVCIDR_VCIDTX           (0x3U<<16)
#define DSI_GVCIDR_VCIDTX_0         (0x1U<<16)
#define DSI_GVCIDR_VCIDRX           (0x3U<<0)
#define DSI_GVCIDR_VCIDRX_0         (0x1U<<0)

