Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_dsi.h
// MCR Configuration

#define DSI_MCR_CMDM                (0x1U<<0)
#define DSI_MCR_CMDM_B_0X0          (0x0U<<0)
#define DSI_MCR_CMDM_B_0X1          (0x1U<<0)

// VMCR Configuration

#define DSI_VMCR_PGO                (0x1U<<24)
#define DSI_VMCR_PGM                (0x1U<<20)
#define DSI_VMCR_PGE                (0x1U<<16)
#define DSI_VMCR_LPCE               (0x1U<<15)
#define DSI_VMCR_FBTAAE             (0x1U<<14)
#define DSI_VMCR_LPHFPE             (0x1U<<13)
#define DSI_VMCR_LPHBPE             (0x1U<<12)
#define DSI_VMCR_LPVAE              (0x1U<<11)
#define DSI_VMCR_LPVFPE             (0x1U<<10)
#define DSI_VMCR_LPVBPE             (0x1U<<9)
#define DSI_VMCR_LPVSAE             (0x1U<<8)
#define DSI_VMCR_VMT                (0x3U<<0)
#define DSI_VMCR_VMT_0              (0x1U<<0)
#define DSI_VMCR_PGO_B_0X0          (0x0U<<24)
#define DSI_VMCR_PGO_B_0X1          (0x1U<<24)
#define DSI_VMCR_PGM_B_0X0          (0x0U<<20)
#define DSI_VMCR_PGM_B_0X1          (0x1U<<20)
#define DSI_VMCR_PGE_B_0X0          (0x0U<<16)
#define DSI_VMCR_PGE_B_0X1          (0x1U<<16)
#define DSI_VMCR_LPCE_B_0X0         (0x0U<<15)
#define DSI_VMCR_LPCE_B_0X1         (0x1U<<15)
#define DSI_VMCR_FBTAAE_B_0X0       (0x0U<<14)
#define DSI_VMCR_FBTAAE_B_0X1       (0x1U<<14)
#define DSI_VMCR_LPHFPE_B_0X0       (0x0U<<13)
#define DSI_VMCR_LPHFPE_B_0X1       (0x1U<<13)
#define DSI_VMCR_LPHBPE_B_0X0       (0x0U<<12)
#define DSI_VMCR_LPHBPE_B_0X1       (0x1U<<12)
#define DSI_VMCR_LPVAE_B_0X0        (0x0U<<11)
#define DSI_VMCR_LPVAE_B_0X1        (0x1U<<11)
#define DSI_VMCR_LPVFPE_B_0X0       (0x0U<<10)
#define DSI_VMCR_LPVFPE_B_0X1       (0x1U<<10)
#define DSI_VMCR_LPVBPE_B_0X0       (0x0U<<9)
#define DSI_VMCR_LPVBPE_B_0X1       (0x1U<<9)
#define DSI_VMCR_LPVSAE_B_0X0       (0x0U<<8)
#define DSI_VMCR_LPVSAE_B_0X1       (0x1U<<8)
#define DSI_VMCR_VMT_B_0X0          (0x0U<<0)
#define DSI_VMCR_VMT_B_0X1          (0x1U<<0)

// VPCR Configuration

#define DSI_VPCR_VPSIZE             (0x3FFFU<<0)
#define DSI_VPCR_VPSIZE_0           (0x1U<<0)

// VCCR Configuration

#define DSI_VCCR_NUMC               (0x1FFFU<<0)
#define DSI_VCCR_NUMC_0             (0x1U<<0)

// VNPCR Configuration

#define DSI_VNPCR_NPSIZE            (0x1FFFU<<0)
#define DSI_VNPCR_NPSIZE_0          (0x1U<<0)

// VHSACR Configuration

#define DSI_VHSACR_HSA              (0xFFFU<<0)
#define DSI_VHSACR_HSA_0            (0x1U<<0)

// VHBPCR Configuration

#define DSI_VHBPCR_HBP              (0xFFFU<<0)
#define DSI_VHBPCR_HBP_0            (0x1U<<0)

// VLCR Configuration

#define DSI_VLCR_HLINE              (0x7FFFU<<0)
#define DSI_VLCR_HLINE_0            (0x1U<<0)

// VVSACR Configuration

#define DSI_VVSACR_VSA              (0x3FFU<<0)
#define DSI_VVSACR_VSA_0            (0x1U<<0)

// VVBPCR Configuration

#define DSI_VVBPCR_VBP              (0x3FFU<<0)
#define DSI_VVBPCR_VBP_0            (0x1U<<0)

// VVFPCR Configuration

#define DSI_VVFPCR_VFP              (0x3FFU<<0)
#define DSI_VVFPCR_VFP_0            (0x1U<<0)

// VVACR Configuration

#define DSI_VVACR_VA                (0x3FFFU<<0)
#define DSI_VVACR_VA_0              (0x1U<<0)

// LCCR Configuration

#define DSI_LCCR_CMDSIZE            (0xFFFFU<<0)
#define DSI_LCCR_CMDSIZE_0          (0x1U<<0)

// CMCR Configuration

#define DSI_CMCR_MRDPS              (0x1U<<24)
#define DSI_CMCR_DLWTX              (0x1U<<19)
#define DSI_CMCR_DSR0TX             (0x1U<<18)
#define DSI_CMCR_DSW1TX             (0x1U<<17)
#define DSI_CMCR_DSW0TX             (0x1U<<16)
#define DSI_CMCR_GLWTX              (0x1U<<14)
#define DSI_CMCR_GSR2TX             (0x1U<<13)
#define DSI_CMCR_GSR1TX             (0x1U<<12)
#define DSI_CMCR_GSR0TX             (0x1U<<11)
#define DSI_CMCR_GSW2TX             (0x1U<<10)
#define DSI_CMCR_GSW1TX             (0x1U<<9)
#define DSI_CMCR_GSW0TX             (0x1U<<8)
#define DSI_CMCR_ARE                (0x1U<<1)
#define DSI_CMCR_TEARE              (0x1U<<0)
#define DSI_CMCR_MRDPS_B_0X0        (0x0U<<24)
#define DSI_CMCR_MRDPS_B_0X1        (0x1U<<24)
#define DSI_CMCR_DLWTX_B_0X0        (0x0U<<19)
#define DSI_CMCR_DLWTX_B_0X1        (0x1U<<19)
#define DSI_CMCR_DSR0TX_B_0X0       (0x0U<<18)
#define DSI_CMCR_DSR0TX_B_0X1       (0x1U<<18)
#define DSI_CMCR_DSW1TX_B_0X0       (0x0U<<17)
#define DSI_CMCR_DSW1TX_B_0X1       (0x1U<<17)
#define DSI_CMCR_DSW0TX_B_0X0       (0x0U<<16)
#define DSI_CMCR_DSW0TX_B_0X1       (0x1U<<16)
#define DSI_CMCR_GLWTX_B_0X0        (0x0U<<14)
#define DSI_CMCR_GLWTX_B_0X1        (0x1U<<14)
#define DSI_CMCR_GSR2TX_B_0X0       (0x0U<<13)
#define DSI_CMCR_GSR2TX_B_0X1       (0x1U<<13)
#define DSI_CMCR_GSR1TX_B_0X0       (0x0U<<12)
#define DSI_CMCR_GSR1TX_B_0X1       (0x1U<<12)
#define DSI_CMCR_GSR0TX_B_0X0       (0x0U<<11)
#define DSI_CMCR_GSR0TX_B_0X1       (0x1U<<11)
#define DSI_CMCR_GSW2TX_B_0X0       (0x0U<<10)
#define DSI_CMCR_GSW2TX_B_0X1       (0x1U<<10)
#define DSI_CMCR_GSW1TX_B_0X0       (0x0U<<9)
#define DSI_CMCR_GSW1TX_B_0X1       (0x1U<<9)
#define DSI_CMCR_GSW0TX_B_0X0       (0x0U<<8)
#define DSI_CMCR_GSW0TX_B_0X1       (0x1U<<8)
#define DSI_CMCR_ARE_B_0X0          (0x0U<<1)
#define DSI_CMCR_ARE_B_0X1          (0x1U<<1)
#define DSI_CMCR_TEARE_B_0X0        (0x0U<<0)
#define DSI_CMCR_TEARE_B_0X1        (0x1U<<0)

// GHCR Configuration

#define DSI_GHCR_WCMSB              (0xFFU<<16)
#define DSI_GHCR_WCMSB_0            (0x1U<<16)
#define DSI_GHCR_WCLSB              (0xFFU<<8)
#define DSI_GHCR_WCLSB_0            (0x1U<<8)
#define DSI_GHCR_VCID               (0x3U<<6)
#define DSI_GHCR_VCID_0             (0x1U<<6)
#define DSI_GHCR_DT                 (0x3FU<<0)
#define DSI_GHCR_DT_0               (0x1U<<0)

// GPDR Configuration

#define DSI_GPDR_DATA4              (0xFFU<<24)
#define DSI_GPDR_DATA4_0            (0x1U<<24)
#define DSI_GPDR_DATA3              (0xFFU<<16)
#define DSI_GPDR_DATA3_0            (0x1U<<16)
#define DSI_GPDR_DATA2              (0xFFU<<8)
#define DSI_GPDR_DATA2_0            (0x1U<<8)
#define DSI_GPDR_DATA1              (0xFFU<<0)
#define DSI_GPDR_DATA1_0            (0x1U<<0)

// GPSR Configuration

#define DSI_GPSR_PBF                (0x1U<<19)
#define DSI_GPSR_PBE                (0x1U<<18)
#define DSI_GPSR_CMDBF              (0x1U<<17)
#define DSI_GPSR_CMDBE              (0x1U<<16)
#define DSI_GPSR_RCB                (0x1U<<6)
#define DSI_GPSR_PRDFF              (0x1U<<5)
#define DSI_GPSR_PRDFE              (0x1U<<4)
#define DSI_GPSR_PWRFF              (0x1U<<3)
#define DSI_GPSR_PWRFE              (0x1U<<2)
#define DSI_GPSR_CMDFF              (0x1U<<1)
#define DSI_GPSR_CMDFE              (0x1U<<0)
#define DSI_GPSR_PBF_B_0X0          (0x0U<<19)
#define DSI_GPSR_PBF_B_0X1          (0x1U<<19)
#define DSI_GPSR_PBE_B_0X0          (0x0U<<18)
#define DSI_GPSR_PBE_B_0X1          (0x1U<<18)
#define DSI_GPSR_CMDBF_B_0X0        (0x0U<<17)
#define DSI_GPSR_CMDBF_B_0X1        (0x1U<<17)
#define DSI_GPSR_CMDBE_B_0X0        (0x0U<<16)
#define DSI_GPSR_CMDBE_B_0X1        (0x1U<<16)
#define DSI_GPSR_RCB_B_0X0          (0x0U<<6)
#define DSI_GPSR_RCB_B_0X1          (0x1U<<6)
#define DSI_GPSR_PRDFF_B_0X0        (0x0U<<5)
#define DSI_GPSR_PRDFF_B_0X1        (0x1U<<5)
#define DSI_GPSR_PRDFE_B_0X0        (0x0U<<4)
#define DSI_GPSR_PRDFE_B_0X1        (0x1U<<4)
#define DSI_GPSR_PWRFF_B_0X0        (0x0U<<3)
#define DSI_GPSR_PWRFF_B_0X1        (0x1U<<3)
#define DSI_GPSR_PWRFE_B_0X0        (0x0U<<2)
#define DSI_GPSR_PWRFE_B_0X1        (0x1U<<2)
#define DSI_GPSR_CMDFF_B_0X0        (0x0U<<1)
#define DSI_GPSR_CMDFF_B_0X1        (0x1U<<1)
#define DSI_GPSR_CMDFE_B_0X0        (0x0U<<0)
#define DSI_GPSR_CMDFE_B_0X1        (0x1U<<0)

// TCCR0 Configuration

