Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_dsi.h
#define DSI_TCCR0_HSTX_TOCNT        (0xFFFFU<<16)
#define DSI_TCCR0_HSTX_TOCNT_0      (0x1U<<16)
#define DSI_TCCR0_LPRX_TOCNT        (0xFFFFU<<0)
#define DSI_TCCR0_LPRX_TOCNT_0      (0x1U<<0)

// TCCR1 Configuration

#define DSI_TCCR1_HSRD_TOCNT        (0xFFFFU<<0)
#define DSI_TCCR1_HSRD_TOCNT_0      (0x1U<<0)

// TCCR2 Configuration

#define DSI_TCCR2_LPRD_TOCNT        (0xFFFFU<<0)
#define DSI_TCCR2_LPRD_TOCNT_0      (0x1U<<0)

// TCCR3 Configuration

#define DSI_TCCR3_PM                (0x1U<<24)
#define DSI_TCCR3_HSWR_TOCNT        (0xFFFFU<<0)
#define DSI_TCCR3_HSWR_TOCNT_0      (0x1U<<0)

// TCCR4 Configuration

#define DSI_TCCR4_LPWR_TOCNT        (0xFFFFU<<0)
#define DSI_TCCR4_LPWR_TOCNT_0      (0x1U<<0)

// TCCR5 Configuration

#define DSI_TCCR5_BTA_TOCNT         (0xFFFFU<<0)
#define DSI_TCCR5_BTA_TOCNT_0       (0x1U<<0)

// CLCR Configuration

#define DSI_CLCR_ACR                (0x1U<<1)
#define DSI_CLCR_DPCC               (0x1U<<0)
#define DSI_CLCR_ACR_B_0X0          (0x0U<<1)
#define DSI_CLCR_ACR_B_0X1          (0x1U<<1)
#define DSI_CLCR_DPCC_B_0X0         (0x0U<<0)
#define DSI_CLCR_DPCC_B_0X1         (0x1U<<0)

// CLTCR Configuration

#define DSI_CLTCR_HS2LP_TIME        (0x3FFU<<16)
#define DSI_CLTCR_HS2LP_TIME_0      (0x1U<<16)
#define DSI_CLTCR_LP2HS_TIME        (0x3FFU<<0)
#define DSI_CLTCR_LP2HS_TIME_0      (0x1U<<0)

// DLTCR Configuration

#define DSI_DLTCR_HS2LP_TIME        (0x3FFU<<16)
#define DSI_DLTCR_HS2LP_TIME_0      (0x1U<<16)
#define DSI_DLTCR_LP2HS_TIME        (0x3FFU<<0)
#define DSI_DLTCR_LP2HS_TIME_0      (0x1U<<0)

// PCTLR Configuration

#define DSI_PCTLR_CKE               (0x1U<<2)
#define DSI_PCTLR_DEN               (0x1U<<1)
#define DSI_PCTLR_CKE_B_0X0         (0x0U<<2)
#define DSI_PCTLR_CKE_B_0X1         (0x1U<<2)
#define DSI_PCTLR_DEN_B_0X0         (0x0U<<1)
#define DSI_PCTLR_DEN_B_0X1         (0x1U<<1)

// PCONFR Configuration

#define DSI_PCONFR_SW_TIME          (0xFFU<<8)
#define DSI_PCONFR_SW_TIME_0        (0x1U<<8)
#define DSI_PCONFR_NL               (0x3U<<0)
#define DSI_PCONFR_NL_0             (0x1U<<0)
#define DSI_PCONFR_NL_B_0X0         (0x0U<<0)
#define DSI_PCONFR_NL_B_0X1         (0x1U<<0)

// PUCR Configuration

#define DSI_PUCR_UEDL               (0x1U<<3)
#define DSI_PUCR_URDL               (0x1U<<2)
#define DSI_PUCR_UECL               (0x1U<<1)
#define DSI_PUCR_URCL               (0x1U<<0)
#define DSI_PUCR_UEDL_B_0X0         (0x0U<<3)
#define DSI_PUCR_UEDL_B_0X1         (0x1U<<3)
#define DSI_PUCR_URDL_B_0X0         (0x0U<<2)
#define DSI_PUCR_URDL_B_0X1         (0x1U<<2)
#define DSI_PUCR_UECL_B_0X0         (0x0U<<1)
#define DSI_PUCR_UECL_B_0X1         (0x1U<<1)
#define DSI_PUCR_URCL_B_0X0         (0x0U<<0)
#define DSI_PUCR_URCL_B_0X1         (0x1U<<0)

// PTTCR Configuration

#define DSI_PTTCR_TX_TRIG           (0xFU<<0)
#define DSI_PTTCR_TX_TRIG_0         (0x1U<<0)

// PSR Configuration

#define DSI_PSR_UAN1                (0x1U<<8)
#define DSI_PSR_PSS1                (0x1U<<7)
#define DSI_PSR_RUE0                (0x1U<<6)
#define DSI_PSR_UAN0                (0x1U<<5)
#define DSI_PSR_PSS0                (0x1U<<4)
#define DSI_PSR_UANC                (0x1U<<3)
#define DSI_PSR_PSSC                (0x1U<<2)
#define DSI_PSR_PD                  (0x1U<<1)

// ISR0 Configuration

#define DSI_ISR0_PE4                (0x1U<<20)
#define DSI_ISR0_PE3                (0x1U<<19)
#define DSI_ISR0_PE2                (0x1U<<18)
#define DSI_ISR0_PE1                (0x1U<<17)
#define DSI_ISR0_PE0                (0x1U<<16)
#define DSI_ISR0_AE15               (0x1U<<15)
#define DSI_ISR0_AE14               (0x1U<<14)
#define DSI_ISR0_AE13               (0x1U<<13)
#define DSI_ISR0_AE12               (0x1U<<12)
#define DSI_ISR0_AE11               (0x1U<<11)
#define DSI_ISR0_AE10               (0x1U<<10)
#define DSI_ISR0_AE9                (0x1U<<9)
#define DSI_ISR0_AE8                (0x1U<<8)
#define DSI_ISR0_AE7                (0x1U<<7)
#define DSI_ISR0_AE6                (0x1U<<6)
#define DSI_ISR0_AE5                (0x1U<<5)
#define DSI_ISR0_AE4                (0x1U<<4)
#define DSI_ISR0_AE3                (0x1U<<3)
#define DSI_ISR0_AE2                (0x1U<<2)
#define DSI_ISR0_AE1                (0x1U<<1)
#define DSI_ISR0_AE0                (0x1U<<0)

// ISR1 Configuration

#define DSI_ISR1_PBUE               (0x1U<<19)
#define DSI_ISR1_GPRXE              (0x1U<<12)
#define DSI_ISR1_GPRDE              (0x1U<<11)
#define DSI_ISR1_GPTXE              (0x1U<<10)
#define DSI_ISR1_GPWRE              (0x1U<<9)
#define DSI_ISR1_GCWRE              (0x1U<<8)
#define DSI_ISR1_LPWRE              (0x1U<<7)
#define DSI_ISR1_EOTPE              (0x1U<<6)
#define DSI_ISR1_PSE                (0x1U<<5)
#define DSI_ISR1_CRCE               (0x1U<<4)
#define DSI_ISR1_ECCME              (0x1U<<3)
#define DSI_ISR1_ECCSE              (0x1U<<2)
#define DSI_ISR1_TOLPRX             (0x1U<<1)
#define DSI_ISR1_TOHSTX             (0x1U<<0)

// IER0 Configuration

#define DSI_IER0_PE4IE              (0x1U<<20)
#define DSI_IER0_PE3IE              (0x1U<<19)
#define DSI_IER0_PE2IE              (0x1U<<18)
#define DSI_IER0_PE1IE              (0x1U<<17)
#define DSI_IER0_PE0IE              (0x1U<<16)
#define DSI_IER0_AE15IE             (0x1U<<15)
#define DSI_IER0_AE14IE             (0x1U<<14)
#define DSI_IER0_AE13IE             (0x1U<<13)
#define DSI_IER0_AE12IE             (0x1U<<12)
#define DSI_IER0_AE11IE             (0x1U<<11)
#define DSI_IER0_AE10IE             (0x1U<<10)
#define DSI_IER0_AE9IE              (0x1U<<9)
#define DSI_IER0_AE8IE              (0x1U<<8)
#define DSI_IER0_AE7IE              (0x1U<<7)
#define DSI_IER0_AE6IE              (0x1U<<6)
#define DSI_IER0_AE5IE              (0x1U<<5)
#define DSI_IER0_AE4IE              (0x1U<<4)
#define DSI_IER0_AE3IE              (0x1U<<3)
#define DSI_IER0_AE2IE              (0x1U<<2)
#define DSI_IER0_AE1IE              (0x1U<<1)
#define DSI_IER0_AE0IE              (0x1U<<0)
#define DSI_IER0_PE4IE_B_0X0        (0x0U<<20)
#define DSI_IER0_PE4IE_B_0X1        (0x1U<<20)
#define DSI_IER0_PE3IE_B_0X0        (0x0U<<19)
#define DSI_IER0_PE3IE_B_0X1        (0x1U<<19)
#define DSI_IER0_PE2IE_B_0X0        (0x0U<<18)
#define DSI_IER0_PE2IE_B_0X1        (0x1U<<18)
#define DSI_IER0_PE1IE_B_0X0        (0x0U<<17)
#define DSI_IER0_PE1IE_B_0X1        (0x1U<<17)
#define DSI_IER0_PE0IE_B_0X0        (0x0U<<16)
#define DSI_IER0_PE0IE_B_0X1        (0x1U<<16)
#define DSI_IER0_AE15IE_B_0X0       (0x0U<<15)
#define DSI_IER0_AE15IE_B_0X1       (0x1U<<15)
#define DSI_IER0_AE14IE_B_0X0       (0x0U<<14)
#define DSI_IER0_AE14IE_B_0X1       (0x1U<<14)
#define DSI_IER0_AE13IE_B_0X0       (0x0U<<13)
#define DSI_IER0_AE13IE_B_0X1       (0x1U<<13)
#define DSI_IER0_AE12IE_B_0X0       (0x0U<<12)
#define DSI_IER0_AE12IE_B_0X1       (0x1U<<12)
#define DSI_IER0_AE11IE_B_0X0       (0x0U<<11)
#define DSI_IER0_AE11IE_B_0X1       (0x1U<<11)
#define DSI_IER0_AE10IE_B_0X0       (0x0U<<10)
#define DSI_IER0_AE10IE_B_0X1       (0x1U<<10)
#define DSI_IER0_AE9IE_B_0X0        (0x0U<<9)
#define DSI_IER0_AE9IE_B_0X1        (0x1U<<9)
#define DSI_IER0_AE8IE_B_0X0        (0x0U<<8)
#define DSI_IER0_AE8IE_B_0X1        (0x1U<<8)
#define DSI_IER0_AE7IE_B_0X0        (0x0U<<7)
#define DSI_IER0_AE7IE_B_0X1        (0x1U<<7)
#define DSI_IER0_AE6IE_B_0X0        (0x0U<<6)
#define DSI_IER0_AE6IE_B_0X1        (0x1U<<6)
#define DSI_IER0_AE5IE_B_0X0        (0x0U<<5)
#define DSI_IER0_AE5IE_B_0X1        (0x1U<<5)
#define DSI_IER0_AE4IE_B_0X0        (0x0U<<4)
#define DSI_IER0_AE4IE_B_0X1        (0x1U<<4)
#define DSI_IER0_AE3IE_B_0X0        (0x0U<<3)
#define DSI_IER0_AE3IE_B_0X1        (0x1U<<3)
#define DSI_IER0_AE2IE_B_0X0        (0x0U<<2)
#define DSI_IER0_AE2IE_B_0X1        (0x1U<<2)
#define DSI_IER0_AE1IE_B_0X0        (0x0U<<1)
#define DSI_IER0_AE1IE_B_0X1        (0x1U<<1)
#define DSI_IER0_AE0IE_B_0X0        (0x0U<<0)
#define DSI_IER0_AE0IE_B_0X1        (0x1U<<0)

