Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_dsi.h
// IER1 Configuration

#define DSI_IER1_PBUEIE             (0x1U<<19)
#define DSI_IER1_GPRXEIE            (0x1U<<12)
#define DSI_IER1_GPRDEIE            (0x1U<<11)
#define DSI_IER1_GPTXEIE            (0x1U<<10)
#define DSI_IER1_GPWREIE            (0x1U<<9)
#define DSI_IER1_GCWREIE            (0x1U<<8)
#define DSI_IER1_LPWREIE            (0x1U<<7)
#define DSI_IER1_EOTPEIE            (0x1U<<6)
#define DSI_IER1_PSEIE              (0x1U<<5)
#define DSI_IER1_CRCEIE             (0x1U<<4)
#define DSI_IER1_ECCMEIE            (0x1U<<3)
#define DSI_IER1_ECCSEIE            (0x1U<<2)
#define DSI_IER1_TOLPRXIE           (0x1U<<1)
#define DSI_IER1_TOHSTXIE           (0x1U<<0)
#define DSI_IER1_PBUEIE_B_0X0       (0x0U<<19)
#define DSI_IER1_PBUEIE_B_0X1       (0x1U<<19)
#define DSI_IER1_GPRXEIE_B_0X0      (0x0U<<12)
#define DSI_IER1_GPRXEIE_B_0X1      (0x1U<<12)
#define DSI_IER1_GPRDEIE_B_0X0      (0x0U<<11)
#define DSI_IER1_GPRDEIE_B_0X1      (0x1U<<11)
#define DSI_IER1_GPTXEIE_B_0X0      (0x0U<<10)
#define DSI_IER1_GPTXEIE_B_0X1      (0x1U<<10)
#define DSI_IER1_GPWREIE_B_0X0      (0x0U<<9)
#define DSI_IER1_GPWREIE_B_0X1      (0x1U<<9)
#define DSI_IER1_GCWREIE_B_0X0      (0x0U<<8)
#define DSI_IER1_GCWREIE_B_0X1      (0x1U<<8)
#define DSI_IER1_LPWREIE_B_0X0      (0x0U<<7)
#define DSI_IER1_LPWREIE_B_0X1      (0x1U<<7)
#define DSI_IER1_EOTPEIE_B_0X0      (0x0U<<6)
#define DSI_IER1_EOTPEIE_B_0X1      (0x1U<<6)
#define DSI_IER1_PSEIE_B_0X0        (0x0U<<5)
#define DSI_IER1_PSEIE_B_0X1        (0x1U<<5)
#define DSI_IER1_CRCEIE_B_0X0       (0x0U<<4)
#define DSI_IER1_CRCEIE_B_0X1       (0x1U<<4)
#define DSI_IER1_ECCMEIE_B_0X0      (0x0U<<3)
#define DSI_IER1_ECCMEIE_B_0X1      (0x1U<<3)
#define DSI_IER1_ECCSEIE_B_0X0      (0x0U<<2)
#define DSI_IER1_ECCSEIE_B_0X1      (0x1U<<2)
#define DSI_IER1_TOLPRXIE_B_0X0     (0x0U<<1)
#define DSI_IER1_TOLPRXIE_B_0X1     (0x1U<<1)
#define DSI_IER1_TOHSTXIE_B_0X0     (0x0U<<0)
#define DSI_IER1_TOHSTXIE_B_0X1     (0x1U<<0)

// FIR0 Configuration

#define DSI_FIR0_FPE4               (0x1U<<20)
#define DSI_FIR0_FPE3               (0x1U<<19)
#define DSI_FIR0_FPE2               (0x1U<<18)
#define DSI_FIR0_FPE1               (0x1U<<17)
#define DSI_FIR0_FPE0               (0x1U<<16)
#define DSI_FIR0_FAE15              (0x1U<<15)
#define DSI_FIR0_FAE14              (0x1U<<14)
#define DSI_FIR0_FAE13              (0x1U<<13)
#define DSI_FIR0_FAE12              (0x1U<<12)
#define DSI_FIR0_FAE11              (0x1U<<11)
#define DSI_FIR0_FAE10              (0x1U<<10)
#define DSI_FIR0_FAE9               (0x1U<<9)
#define DSI_FIR0_FAE8               (0x1U<<8)
#define DSI_FIR0_FAE7               (0x1U<<7)
#define DSI_FIR0_FAE6               (0x1U<<6)
#define DSI_FIR0_FAE5               (0x1U<<5)
#define DSI_FIR0_FAE4               (0x1U<<4)
#define DSI_FIR0_FAE3               (0x1U<<3)
#define DSI_FIR0_FAE2               (0x1U<<2)
#define DSI_FIR0_FAE1               (0x1U<<1)
#define DSI_FIR0_FAE0               (0x1U<<0)

// FIR1 Configuration

#define DSI_FIR1_FPBUE              (0x1U<<19)
#define DSI_FIR1_FGPRXE             (0x1U<<12)
#define DSI_FIR1_FGPRDE             (0x1U<<11)
#define DSI_FIR1_FGPTXE             (0x1U<<10)
#define DSI_FIR1_FGPWRE             (0x1U<<9)
#define DSI_FIR1_FGCWRE             (0x1U<<8)
#define DSI_FIR1_FLPWRE             (0x1U<<7)
#define DSI_FIR1_FEOTPE             (0x1U<<6)
#define DSI_FIR1_FPSE               (0x1U<<5)
#define DSI_FIR1_FCRCE              (0x1U<<4)
#define DSI_FIR1_FECCME             (0x1U<<3)
#define DSI_FIR1_FECCSE             (0x1U<<2)
#define DSI_FIR1_FTOLPRX            (0x1U<<1)
#define DSI_FIR1_FTOHSTX            (0x1U<<0)

// DLTRCR Configuration

#define DSI_DLTRCR_MRD_TIME         (0x7FFFU<<0)
#define DSI_DLTRCR_MRD_TIME_0       (0x1U<<0)

// VSCR Configuration

#define DSI_VSCR_UR                 (0x1U<<8)
#define DSI_VSCR_EN                 (0x1U<<0)
#define DSI_VSCR_UR_B_0X0           (0x0U<<8)
#define DSI_VSCR_UR_B_0X1           (0x1U<<8)
#define DSI_VSCR_EN_B_0X0           (0x0U<<0)
#define DSI_VSCR_EN_B_0X1           (0x1U<<0)

// LCVCIDR Configuration

#define DSI_LCVCIDR_VCID            (0x3U<<0)
#define DSI_LCVCIDR_VCID_0          (0x1U<<0)

// LCCCR Configuration

#define DSI_LCCCR_LPE               (0x1U<<8)
#define DSI_LCCCR_COLC              (0xFU<<0)
#define DSI_LCCCR_COLC_0            (0x1U<<0)
#define DSI_LCCCR_LPE_B_0X0         (0x0U<<8)
#define DSI_LCCCR_LPE_B_0X1         (0x1U<<8)
#define DSI_LCCCR_COLC_B_0X0        (0x0U<<0)
#define DSI_LCCCR_COLC_B_0X1        (0x1U<<0)
#define DSI_LCCCR_COLC_B_0X2        (0x2U<<0)
#define DSI_LCCCR_COLC_B_0X3        (0x3U<<0)
#define DSI_LCCCR_COLC_B_0X4        (0x4U<<0)
#define DSI_LCCCR_COLC_B_0X5        (0x5U<<0)

// LPMCCR Configuration

#define DSI_LPMCCR_LPSIZE           (0xFFU<<16)
#define DSI_LPMCCR_LPSIZE_0         (0x1U<<16)
#define DSI_LPMCCR_VLPSIZE          (0xFFU<<0)
#define DSI_LPMCCR_VLPSIZE_0        (0x1U<<0)

// VMCCR Configuration

#define DSI_VMCCR_LPCE              (0x1U<<9)
#define DSI_VMCCR_FBTAAE            (0x1U<<8)
#define DSI_VMCCR_LPHFE             (0x1U<<7)
#define DSI_VMCCR_LPHBPE            (0x1U<<6)
#define DSI_VMCCR_LPVAE             (0x1U<<5)
#define DSI_VMCCR_LPVFPE            (0x1U<<4)
#define DSI_VMCCR_LPVBPE            (0x1U<<3)
#define DSI_VMCCR_LPVSAE            (0x1U<<2)
#define DSI_VMCCR_VMT               (0x3U<<0)
#define DSI_VMCCR_VMT_0             (0x1U<<0)
#define DSI_VMCCR_LPCE_B_0X0        (0x0U<<9)
#define DSI_VMCCR_LPCE_B_0X1        (0x1U<<9)
#define DSI_VMCCR_FBTAAE_B_0X0      (0x0U<<8)
#define DSI_VMCCR_FBTAAE_B_0X1      (0x1U<<8)
#define DSI_VMCCR_LPHFE_B_0X0       (0x0U<<7)
#define DSI_VMCCR_LPHFE_B_0X1       (0x1U<<7)
#define DSI_VMCCR_LPHBPE_B_0X0      (0x0U<<6)
#define DSI_VMCCR_LPHBPE_B_0X1      (0x1U<<6)
#define DSI_VMCCR_LPVAE_B_0X0       (0x0U<<5)
#define DSI_VMCCR_LPVAE_B_0X1       (0x1U<<5)
#define DSI_VMCCR_LPVFPE_B_0X0      (0x0U<<4)
#define DSI_VMCCR_LPVFPE_B_0X1      (0x1U<<4)
#define DSI_VMCCR_LPVBPE_B_0X0      (0x0U<<3)
#define DSI_VMCCR_LPVBPE_B_0X1      (0x1U<<3)
#define DSI_VMCCR_LPVSAE_B_0X0      (0x0U<<2)
#define DSI_VMCCR_LPVSAE_B_0X1      (0x1U<<2)
#define DSI_VMCCR_VMT_B_0X0         (0x0U<<0)
#define DSI_VMCCR_VMT_B_0X1         (0x1U<<0)

