Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_dsi.h
// VPCCR Configuration

#define DSI_VPCCR_VPSIZE            (0x3FFFU<<0)
#define DSI_VPCCR_VPSIZE_0          (0x1U<<0)

// VCCCR Configuration

#define DSI_VCCCR_NUMC              (0x1FFFU<<0)
#define DSI_VCCCR_NUMC_0            (0x1U<<0)

// VNPCCR Configuration

#define DSI_VNPCCR_NPSIZE           (0x1FFFU<<0)
#define DSI_VNPCCR_NPSIZE_0         (0x1U<<0)

// VHSACCR Configuration

#define DSI_VHSACCR_HSA             (0xFFFU<<0)
#define DSI_VHSACCR_HSA_0           (0x1U<<0)

// VHBPCCR Configuration

#define DSI_VHBPCCR_HBP             (0xFFFU<<0)
#define DSI_VHBPCCR_HBP_0           (0x1U<<0)

// VLCCR Configuration

#define DSI_VLCCR_HLINE             (0x7FFFU<<0)
#define DSI_VLCCR_HLINE_0           (0x1U<<0)

// VVSACCR Configuration

#define DSI_VVSACCR_VSA             (0x3FFU<<0)
#define DSI_VVSACCR_VSA_0           (0x1U<<0)

// VVBPCCR Configuration

#define DSI_VVBPCCR_VBP             (0x3FFU<<0)
#define DSI_VVBPCCR_VBP_0           (0x1U<<0)

// VVFPCCR Configuration

#define DSI_VVFPCCR_VFP             (0x3FFU<<0)
#define DSI_VVFPCCR_VFP_0           (0x1U<<0)

// VVACCR Configuration

#define DSI_VVACCR_VA               (0x3FFFU<<0)
#define DSI_VVACCR_VA_0             (0x1U<<0)

// FBSR Configuration

#define DSI_FBSR_APBF               (0x1U<<23)
#define DSI_FBSR_APBE               (0x1U<<22)
#define DSI_FBSR_ACBF               (0x1U<<21)
#define DSI_FBSR_ACBE               (0x1U<<20)
#define DSI_FBSR_VPBF               (0x1U<<17)
#define DSI_FBSR_VPBE               (0x1U<<16)
#define DSI_FBSR_APWFF              (0x1U<<7)
#define DSI_FBSR_APWFE              (0x1U<<6)
#define DSI_FBSR_ACWFF              (0x1U<<5)
#define DSI_FBSR_ACWFE              (0x1U<<4)
#define DSI_FBSR_VPWFF              (0x1U<<3)
#define DSI_FBSR_VPWFE              (0x1U<<2)
#define DSI_FBSR_VCWFF              (0x1U<<1)
#define DSI_FBSR_VCWFE              (0x1U<<0)
#define DSI_FBSR_APBF_B_0X0         (0x0U<<23)
#define DSI_FBSR_APBF_B_0X1         (0x1U<<23)
#define DSI_FBSR_APBE_B_0X0         (0x0U<<22)
#define DSI_FBSR_APBE_B_0X1         (0x1U<<22)
#define DSI_FBSR_ACBF_B_0X0         (0x0U<<21)
#define DSI_FBSR_ACBF_B_0X1         (0x1U<<21)
#define DSI_FBSR_ACBE_B_0X0         (0x0U<<20)
#define DSI_FBSR_ACBE_B_0X1         (0x1U<<20)
#define DSI_FBSR_VPBF_B_0X0         (0x0U<<17)
#define DSI_FBSR_VPBF_B_0X1         (0x1U<<17)
#define DSI_FBSR_VPBE_B_0X0         (0x0U<<16)
#define DSI_FBSR_VPBE_B_0X1         (0x1U<<16)
#define DSI_FBSR_APWFF_B_0X0        (0x0U<<7)
#define DSI_FBSR_APWFF_B_0X1        (0x1U<<7)
#define DSI_FBSR_APWFE_B_0X0        (0x0U<<6)
#define DSI_FBSR_APWFE_B_0X1        (0x1U<<6)
#define DSI_FBSR_ACWFF_B_0X0        (0x0U<<5)
#define DSI_FBSR_ACWFF_B_0X1        (0x1U<<5)
#define DSI_FBSR_ACWFE_B_0X0        (0x0U<<4)
#define DSI_FBSR_ACWFE_B_0X1        (0x1U<<4)
#define DSI_FBSR_VPWFF_B_0X0        (0x0U<<3)
#define DSI_FBSR_VPWFF_B_0X1        (0x1U<<3)
#define DSI_FBSR_VPWFE_B_0X0        (0x0U<<2)
#define DSI_FBSR_VPWFE_B_0X1        (0x1U<<2)
#define DSI_FBSR_VCWFF_B_0X0        (0x0U<<1)
#define DSI_FBSR_VCWFF_B_0X1        (0x1U<<1)
#define DSI_FBSR_VCWFE_B_0X0        (0x0U<<0)
#define DSI_FBSR_VCWFE_B_0X1        (0x1U<<0)

// WCFGR Configuration

#define DSI_WCFGR_VSPOL             (0x1U<<7)
#define DSI_WCFGR_AR                (0x1U<<6)
#define DSI_WCFGR_TEPOL             (0x1U<<5)
#define DSI_WCFGR_TESRC             (0x1U<<4)
#define DSI_WCFGR_COLMUX            (0x7U<<1)
#define DSI_WCFGR_COLMUX_0          (0x1U<<1)
#define DSI_WCFGR_DSIM              (0x1U<<0)
#define DSI_WCFGR_VSPOL_B_0X0       (0x0U<<7)
#define DSI_WCFGR_VSPOL_B_0X1       (0x1U<<7)
#define DSI_WCFGR_AR_B_0X0          (0x0U<<6)
#define DSI_WCFGR_AR_B_0X1          (0x1U<<6)
#define DSI_WCFGR_TEPOL_B_0X0       (0x0U<<5)
#define DSI_WCFGR_TEPOL_B_0X1       (0x1U<<5)
#define DSI_WCFGR_TESRC_B_0X0       (0x0U<<4)
#define DSI_WCFGR_TESRC_B_0X1       (0x1U<<4)
#define DSI_WCFGR_COLMUX_B_0X0      (0x0U<<1)
#define DSI_WCFGR_COLMUX_B_0X1      (0x1U<<1)
#define DSI_WCFGR_COLMUX_B_0X2      (0x2U<<1)
#define DSI_WCFGR_COLMUX_B_0X3      (0x3U<<1)
#define DSI_WCFGR_COLMUX_B_0X4      (0x4U<<1)
#define DSI_WCFGR_COLMUX_B_0X5      (0x5U<<1)
#define DSI_WCFGR_DSIM_B_0X0        (0x0U<<0)
#define DSI_WCFGR_DSIM_B_0X1        (0x1U<<0)

// WCR Configuration

#define DSI_WCR_DSIEN               (0x1U<<3)
#define DSI_WCR_LTDCEN              (0x1U<<2)
#define DSI_WCR_SHTDN               (0x1U<<1)
#define DSI_WCR_COLM                (0x1U<<0)
#define DSI_WCR_DSIEN_B_0X0         (0x0U<<3)
#define DSI_WCR_DSIEN_B_0X1         (0x1U<<3)
#define DSI_WCR_LTDCEN_B_0X0        (0x0U<<2)
#define DSI_WCR_LTDCEN_B_0X1        (0x1U<<2)
#define DSI_WCR_SHTDN_B_0X0         (0x0U<<1)
#define DSI_WCR_SHTDN_B_0X1         (0x1U<<1)
#define DSI_WCR_COLM_B_0X0          (0x0U<<0)
#define DSI_WCR_COLM_B_0X1          (0x1U<<0)

// WIER Configuration

#define DSI_WIER_PLLUIE             (0x1U<<10)
#define DSI_WIER_PLLLIE             (0x1U<<9)
#define DSI_WIER_ERIE               (0x1U<<1)
#define DSI_WIER_TEIE               (0x1U<<0)
#define DSI_WIER_PLLUIE_B_0X0       (0x0U<<10)
#define DSI_WIER_PLLUIE_B_0X1       (0x1U<<10)
#define DSI_WIER_PLLLIE_B_0X0       (0x0U<<9)
#define DSI_WIER_PLLLIE_B_0X1       (0x1U<<9)
#define DSI_WIER_ERIE_B_0X0         (0x0U<<1)
#define DSI_WIER_ERIE_B_0X1         (0x1U<<1)
#define DSI_WIER_TEIE_B_0X0         (0x0U<<0)
#define DSI_WIER_TEIE_B_0X1         (0x1U<<0)

// WISR Configuration

#define DSI_WISR_PLLUIF             (0x1U<<10)
#define DSI_WISR_PLLLIF             (0x1U<<9)
#define DSI_WISR_PLLLS              (0x1U<<8)
#define DSI_WISR_BUSY               (0x1U<<2)
#define DSI_WISR_ERIF               (0x1U<<1)
#define DSI_WISR_TEIF               (0x1U<<0)
#define DSI_WISR_PLLUIF_B_0X0       (0x0U<<10)
#define DSI_WISR_PLLUIF_B_0X1       (0x1U<<10)
#define DSI_WISR_PLLLIF_B_0X0       (0x0U<<9)
#define DSI_WISR_PLLLIF_B_0X1       (0x1U<<9)
#define DSI_WISR_PLLLS_B_0X0        (0x0U<<8)
#define DSI_WISR_PLLLS_B_0X1        (0x1U<<8)
#define DSI_WISR_BUSY_B_0X0         (0x0U<<2)
#define DSI_WISR_BUSY_B_0X1         (0x1U<<2)
#define DSI_WISR_ERIF_B_0X0         (0x0U<<1)
#define DSI_WISR_ERIF_B_0X1         (0x1U<<1)
#define DSI_WISR_TEIF_B_0X0         (0x0U<<0)
#define DSI_WISR_TEIF_B_0X1         (0x1U<<0)

// WIFCR Configuration

#define DSI_WIFCR_CPLLUIF           (0x1U<<10)
#define DSI_WIFCR_CPLLLIF           (0x1U<<9)
#define DSI_WIFCR_CERIF             (0x1U<<1)
#define DSI_WIFCR_CTEIF             (0x1U<<0)

// WPCR0 Configuration

#define DSI_WPCR0_FTXSMDL           (0x1U<<13)
#define DSI_WPCR0_FTXSMCL           (0x1U<<12)
#define DSI_WPCR0_SWDL1             (0x1U<<8)
#define DSI_WPCR0_SWDL0             (0x1U<<7)
#define DSI_WPCR0_SWCL              (0x1U<<6)
#define DSI_WPCR0_FTXSMDL_B_0X0     (0x0U<<13)
#define DSI_WPCR0_FTXSMDL_B_0X1     (0x1U<<13)
#define DSI_WPCR0_FTXSMCL_B_0X0     (0x0U<<12)
#define DSI_WPCR0_FTXSMCL_B_0X1     (0x1U<<12)
#define DSI_WPCR0_SWDL1_B_0X0       (0x0U<<8)
#define DSI_WPCR0_SWDL1_B_0X1       (0x1U<<8)
#define DSI_WPCR0_SWDL0_B_0X0       (0x0U<<7)
#define DSI_WPCR0_SWDL0_B_0X1       (0x1U<<7)
#define DSI_WPCR0_SWCL_B_0X0        (0x0U<<6)
#define DSI_WPCR0_SWCL_B_0X1        (0x1U<<6)

// WRPCR Configuration

#define DSI_WRPCR_ODF               (0x1FFU<<20)
#define DSI_WRPCR_ODF_0             (0x1U<<20)
#define DSI_WRPCR_IDF               (0x1FFU<<11)
#define DSI_WRPCR_IDF_0             (0x1U<<11)
#define DSI_WRPCR_NDIV              (0x1FFU<<2)
#define DSI_WRPCR_NDIV_0            (0x1U<<2)
#define DSI_WRPCR_PLLEN             (0x1U<<0)
#define DSI_WRPCR_ODF_B_0X0         (0x0U<<20)
#define DSI_WRPCR_ODF_B_0X1         (0x1U<<20)
#define DSI_WRPCR_IDF_B_0X0         (0x0U<<11)
#define DSI_WRPCR_IDF_B_0X1         (0x1U<<11)
#define DSI_WRPCR_NDIV_B_0X0        (0x0U<<2)
#define DSI_WRPCR_NDIV_B_0X1        (0x1U<<2)
#define DSI_WRPCR_PLLEN_B_0X0       (0x0U<<0)
#define DSI_WRPCR_PLLEN_B_0X1       (0x1U<<0)

// BCFGR Configuration

#define DSI_BCFGR_PWRUP             (0x1U<<6)
#define DSI_BCFGR_PWRUP_B_0X0       (0x0U<<6)
#define DSI_BCFGR_PWRUP_B_0X1       (0x1U<<6)

