Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_dsi.h
// DPCBCR Configuration

#define DSI_DPCBCR_BC               (0x1FU<<3)
#define DSI_DPCBCR_BC_0             (0x1U<<3)
#define DSI_DPCBCR_BC_B_0X0         (0x0U<<3)
#define DSI_DPCBCR_BC_B_0X1         (0x1U<<3)
#define DSI_DPCBCR_BC_B_0X2         (0x2U<<3)
#define DSI_DPCBCR_BC_B_0X3         (0x3U<<3)
#define DSI_DPCBCR_BC_B_0X4         (0x4U<<3)
#define DSI_DPCBCR_BC_B_0X5         (0x5U<<3)
#define DSI_DPCBCR_BC_B_0X6         (0x6U<<3)
#define DSI_DPCBCR_BC_B_0X7         (0x7U<<3)
#define DSI_DPCBCR_BC_B_0X8         (0x8U<<3)

// DPCSRCR Configuration

#define DSI_DPCSRCR_SRC             (0xFFU<<0)
#define DSI_DPCSRCR_SRC_0           (0x1U<<0)
#define DSI_DPCSRCR_SRC_B_0XE       (0xEU<<0)

// DPDL0BCR Configuration

#define DSI_DPDL0BCR_BC             (0x1FU<<0)
#define DSI_DPDL0BCR_BC_0           (0x1U<<0)
#define DSI_DPDL0BCR_BC_B_0X0       (0x0U<<0)
#define DSI_DPDL0BCR_BC_B_0X1       (0x1U<<0)
#define DSI_DPDL0BCR_BC_B_0X2       (0x2U<<0)
#define DSI_DPDL0BCR_BC_B_0X3       (0x3U<<0)
#define DSI_DPDL0BCR_BC_B_0X4       (0x4U<<0)
#define DSI_DPDL0BCR_BC_B_0X5       (0x5U<<0)
#define DSI_DPDL0BCR_BC_B_0X6       (0x6U<<0)
#define DSI_DPDL0BCR_BC_B_0X7       (0x7U<<0)
#define DSI_DPDL0BCR_BC_B_0X8       (0x8U<<0)

// DPDL0SRCR Configuration

#define DSI_DPDL0SRCR_SRC           (0xFFU<<0)
#define DSI_DPDL0SRCR_SRC_0         (0x1U<<0)
#define DSI_DPDL0SRCR_SRC_B_0XE     (0xEU<<0)

// DPDL1BCR Configuration

#define DSI_DPDL1BCR_BC             (0x1FU<<0)
#define DSI_DPDL1BCR_BC_0           (0x1U<<0)
#define DSI_DPDL1BCR_BC_B_0X0       (0x0U<<0)
#define DSI_DPDL1BCR_BC_B_0X1       (0x1U<<0)
#define DSI_DPDL1BCR_BC_B_0X2       (0x2U<<0)
#define DSI_DPDL1BCR_BC_B_0X3       (0x3U<<0)
#define DSI_DPDL1BCR_BC_B_0X4       (0x4U<<0)
#define DSI_DPDL1BCR_BC_B_0X5       (0x5U<<0)
#define DSI_DPDL1BCR_BC_B_0X6       (0x6U<<0)
#define DSI_DPDL1BCR_BC_B_0X7       (0x7U<<0)
#define DSI_DPDL1BCR_BC_B_0X8       (0x8U<<0)

// DPDL1SRCR Configuration

#define DSI_DPDL1SRCR_SRC           (0xFFU<<0)
#define DSI_DPDL1SRCR_SRC_0         (0x1U<<0)
#define DSI_DPDL1SRCR_SRC_B_0XE     (0xEU<<0)
